# Добашнее задание 4 - Двухвыборочный t-критерий
# Авакян Кристина
# Группа: ББ5А23/10

# Вариант 1.
# Рост эльфов из вашего отряда (см): 167, 176, 176, 174, 166, 168, 178, 176, 178, 181, 177, 182, 184, 177, 187
# Рост фигур (см): 176, 165, 165, 156, 160, 167, 176, 161, 164, 168, 174, 158

# ==================================================================
# 1. Формируем два вектора, один с данными по росту эльфов,
#.   второй с данными по росту фигур вдали
# ==================================================================

elves <- c(167, 176, 176, 174, 166, 168, 178, 176, 178, 181, 177, 182, 184, 177, 187)
figures <- c(176, 165, 165, 156, 160, 167, 176, 161, 164, 168, 174, 158)

# ==================================================================
# 2. Формулируем гипотезы:
# ==================================================================

# - H0 (нулевая): средний рост фигур такой же, как у эльфов: mu_figures = mu_elves
# - H1 (альтернативная): средние различаются: mu_figures != mu_elves

# ==================================================================
# 3. Рассчитываем двухвыборочный t-критерий
#    Используем t-критерий Уэлча (var.equal = FALSE),
#    т.к. дисперсии могут быть разными
# ==================================================================

test_res <- t.test(elves, figures, var.equal = FALSE, alternative = "two.sided")
test_res

# p-value = 0.0002976

# ==================================================================
# 4. Делаем вывод
# ==================================================================

test_res$p.value < 0.05

# Так как p-value < 0.05 (alpha), отвергаем H0 и считаем, что отряды различаются по росту.
# Средний рост фигур статистически значимо отличается от роста эльфов.
# Скорее всего, это чужой отряд (фигуры ниже).

# ==================================================================
# 5. Визуализируем данные, как столбчатую диаграмму средних ростов
# ==================================================================

# Загружаем пакет ggplot2
library(ggplot2)

# Функция для расчета среднего и ДИ
mean_ci <- function(x, percent = 0.95){
  n <- length(x)
  Mean <- mean(x)
  SD <- sd(x)
  SE <- SD / sqrt(n)
  t_krit <- qt((1 + percent)/2, df = n - 1)
  c(mean = Mean,
    lower = Mean - t_krit * SE,
    upper = Mean + t_krit * SE)
}

# Считаем статистику и 95% ДИ для среднего
ci_elves   <- mean_ci(elves)
ci_figures <- mean_ci(figures)

# Формируем датафрейм с даными для графика
df <- data.frame(
  group = c("Эльфы", "Фигуры"),
  mean_height = c(ci_elves["mean"], ci_figures["mean"]),
  lower = c(ci_elves["lower"], ci_figures["lower"]),
  upper = c(ci_elves["upper"], ci_figures["upper"])
)

# Рисуем график
ggplot(df, aes(x = group, y = mean_height)) +
  geom_col(width = 0.6,  fill = c("green", "red")) +
  geom_point() +
  geom_errorbar(aes(ymin = lower, ymax = upper),
                width = 0.15,
                linewidth = 0.8) +
  geom_text(aes(label = round(mean_height, 1)),
            vjust = -1.6,
            size = 5) +
  labs(title = "Сравнение среднего роста (95% ДИ)",
       x = NULL,
       y = "Средний рост, см") +
  ylim(0, max(df$upper) + 15) +
  theme_minimal(base_size = 14) +
  theme(legend.position = "none") -> plot_elves_height

# Показываем график
plot_elves_height

# Сохраняем график
# ggsave("Images/Avakian_Elves_Height.jpg", plot = plot_elves_height)

